In [33]:
import requests, bs4
import pandas as pd


headers = {'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:71.0) Gecko/20100101 Firefox/71.0'}

#웹페이지 html 소스 가져오기
resp = requests.get("https://sparkkorea.com/%ed%85%8c%ec%8a%a4%ed%8a%b8/", headers=headers)
resp.encoding='utf-8'
html = resp.text
htmlobj = bs4.BeautifulSoup(html, 'html.parser')

In [35]:
parent = htmlobj.find(name = 'table', id = 'test_table')

In [36]:
parent

<table class="type07" id="test_table">
<thead>
<tr>
<th scope="cols">학번</th>
<th scope="cols">이름</th>
</tr>
</thead>
<tbody>
<tr>
<td>101</td>
<td>김효관</td>
</tr>
<tr>
<td>102</td>
<td>이순신</td>
</tr>
<tr>
<td>103</td>
<td>김어진</td>
</tr>
</tbody>
</table>

In [38]:
tbodytags = parent.find('tbody')

In [40]:
trs = tbodytags.findAll('tr')

In [45]:
trs[0].findAll('td')

In [46]:
columns = []
rows = []
for i in range(0,len(trs)):
    eachtr = trs[i]
    tds = trs[i].findAll('td')
    for j in range(0,len(tds)):
        eachtd = tds[j].text
        columns.append(eachtd)
    rows.append(columns)
    columns = []
print(rows)

[['101', '김효관'], ['102', '이순신'], ['103', '김어진']]

In [49]:
result = pd.DataFrame(rows)

In [50]:
result.columns = ['순번','이름']

In [51]:
result

    순번   이름
0  101  김효관
1  102  이순신
2  103  김어진

In [53]:
theadtag = parent.find('thead')

In [54]:
theadtag

<thead>
<tr>
<th scope="cols">학번</th>
<th scope="cols">이름</th>
</tr>
</thead>

In [56]:
theadtag.findAll('th')

In [58]:
ths = theadtag.findAll('th')

In [59]:
ths

In [60]:
headname = []
for i in range(0,len(ths)):
    eachths = ths[i].text
    headname.append(eachths)

In [61]:
headname

['학번', '이름']

In [63]:
result.coulmns = headname

<ipython-input-63-904c1ed1220e>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  result.coulmns = headname

In [65]:
columns = []
rows = []
# for k in range(0,2):
#     eachhead = headname[k]
#     columns.append(eachhead)
# rows.append(columns)

for i in range(0,len(trs)):
    eachtr = trs[i]
    tds = trs[i].findAll('td')
    for j in range(0,len(tds)):
        eachtd = tds[j].text
        columns.append(eachtd)
    rows.append(columns)
    columns = []
print(rows)

[['학번', '이름', '101', '김효관'], ['학번', '이름', '101', '김효관'], ['102', '이순신'], ['103', '김어진']]

In [24]:
targetParents = htmlobj.find( name = "table",attrs = {"id":"test_table"})
targetParents
# 원하는 테이블을 불러온다.

<table class="type07" id="test_table">
<thead>
<tr>
<th scope="cols">학번</th>
<th scope="cols">이름</th>
</tr>
</thead>
<tbody>
<tr>
<td>101</td>
<td>김효관</td>
</tr>
<tr>
<td>102</td>
<td>이순신</td>
</tr>
<tr>
<td>103</td>
<td>김어진</td>
</tr>
</tbody>
</table>

In [25]:
tbodytags = targetParents.find( name = "tbody")
tbodytags
# tbody라는 태그를 찾아서 불러온다

<tbody>
<tr>
<td>101</td>
<td>김효관</td>
</tr>
<tr>
<td>102</td>
<td>이순신</td>
</tr>
<tr>
<td>103</td>
<td>김어진</td>
</tr>
</tbody>

In [26]:
trs = tbodytags.findAll("tr")
# tr 태그로 감싸진 것들을 인덱스에 담았다.
print(len(trs))
trs[0]

3

<tr>
<td>101</td>
<td>김효관</td>
</tr>

In [11]:
eachtr = trs[0]

In [12]:
eachtr

<tr>
<td>101</td>
<td>김효관</td>
</tr>

In [14]:
tds = eachtr.findAll('td')

In [15]:
tds

In [16]:
tds[0].text

'101'

In [29]:
columns = []
rows = []
for j in range(0,len(trs)):
    eachtr = trs[j]
    tds = eachtr.findAll('td')
    for i in range(0, len(tds)):
        eachtd = tds[i]
        columns.append(eachtd.text)
    rows.append(columns)
    columns = []

In [30]:
columns

[]

In [31]:
rows

[['101', '김효관'], ['102', '이순신'], ['103', '김어진']]

In [32]:
pd.DataFrame(rows)

     0    1
0  101  김효관
1  102  이순신
2  103  김어진

In [4]:
atags[0].attrs["href"]

'https://forms.gle/Fw49w9GhWQChDcZm7'

In [5]:
atags[0].text

' 6/13 Spark 심화과정 '

In [7]:
columns = []
rows = []
for i in range(0,len(atags)):
    each = atags[i]
    columns.append(each.text)
    columns.append(each.attrs['href'])
    rows.append(columns)
    columns = []

In [8]:
rows

[[' 6/13 Spark 심화과정 ', 'https://forms.gle/Fw49w9GhWQChDcZm7'],
 [' 6/13 Spark 기본과정 ', 'https://forms.gle/G4TcXm3fKuHLHA6D6'],
 [' 6/18 Spark [MAP_FILTER] ', 'https://forms.gle/M8gr1kC2ubA3UDVp8'],
 [' 6/18 Spark GroupBy 심화 ', 'https://forms.gle/h8w5mZ4MNaPLCPbi6'],
 [' 6/25 Spark RDD 실전 분석 ', 'https://forms.gle/q5yL6QHfueDLM5w27'],
 [' 6/27 Spark RDD 실전 분석2 ', 'https://forms.gle/Gxb4y6LfVYiaLu4M7']]

In [10]:
result = pd.DataFrame(rows)

In [11]:
result.columns = ['과정','주소']

In [12]:
result

                          과정                                   주소
0           6/13 Spark 심화과정   https://forms.gle/Fw49w9GhWQChDcZm7
1           6/13 Spark 기본과정   https://forms.gle/G4TcXm3fKuHLHA6D6
2   6/18 Spark [MAP_FILTER]   https://forms.gle/M8gr1kC2ubA3UDVp8
3     6/18 Spark GroupBy 심화   https://forms.gle/h8w5mZ4MNaPLCPbi6
4      6/25 Spark RDD 실전 분석   https://forms.gle/q5yL6QHfueDLM5w27
5     6/27 Spark RDD 실전 분석2   https://forms.gle/Gxb4y6LfVYiaLu4M7

In [126]:
try:
    4 / 0
except ZeroDivisionError as e:
    print(e)

division by zero